{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 257], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "bidirectional_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_2"}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "bidirectional_2"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_3", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_3"}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "name": "bidirectional_3"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_4", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_4"}, "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]], "name": "bidirectional_4"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5140, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "embed_audio"}, "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]], "name": "embed_audio"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 257, 20], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["embed_audio", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 20], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "reshape_2"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAACAAAAAwAAAFMAAABzHwAAAGQBAGQAAGwAAH0BAHwBAGoBAGoCAHwAAGQBAIMCAFMoAgAA\nAE5p/////ygDAAAAdAoAAAB0ZW5zb3JmbG93dAIAAABubnQMAAAAbDJfbm9ybWFsaXplKAIAAAB0\nBgAAAGlucHV0c3QCAAAAdGYoAAAAACgAAAAAczkAAAAvaG9tZS9ib2NoZW4vcHJvamVjdHMvdm9p\nY2Vfc2VwYXJhdGlvbi9jb2RlL2Z1bmNfbW9kZWwucHl0BwAAAGwyX25vcm1MAAAAcwQAAAAAAQwB\n", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 257, 20], "trainable": true, "name": "reshape_3"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "reshape_3"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_3", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}